-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1:3306
-- 生成日期： 2018-12-27 07:22:03
-- 服务器版本： 5.7.23
-- PHP 版本： 7.2.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `csair`
--

-- --------------------------------------------------------

--
-- 表的结构 `t_luggage`
--

DROP TABLE IF EXISTS `t_luggage`;
CREATE TABLE IF NOT EXISTS `t_luggage` (
  `lno` varchar(256) COLLATE utf8_bin DEFAULT NULL,
  `pno` varchar(256) COLLATE utf8_bin NOT NULL,
  `sizeA` varchar(256) COLLATE utf8_bin NOT NULL,
  `sizeB` varchar(256) COLLATE utf8_bin NOT NULL,
  `sizeC` varchar(256) COLLATE utf8_bin NOT NULL,
  `totalSize` varchar(256) COLLATE utf8_bin NOT NULL,
  `weight` varchar(256) COLLATE utf8_bin NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `t_luggage`
--

INSERT INTO `t_luggage` (`lno`, `pno`, `sizeA`, `sizeB`, `sizeC`, `totalSize`, `weight`) VALUES
(NULL, '39', '60', '60', '60', '1', '10'),
(NULL, '38', '60', '60', '60', '1', '0'),
(NULL, '37', '60', '60', '60', '-1', '20'),
(NULL, '36', '40', '40', '80', '160', '40'),
(NULL, '36', '40', '60', '100', '200', '20'),
(NULL, '35', '40', '40', '80', '160', '30'),
(NULL, '35', '40', '40', '80', '160', '10'),
(NULL, '34', '40', '40', '80', '140', '10'),
(NULL, '34', '40', '40', '80', '110', '10'),
(NULL, '34', '40', '40', '80', '120', '10'),
(NULL, '33', '33', '33', '33', '99', '17'),
(NULL, '33', '43', '43', '43', '129', '24'),
(NULL, '33', '33', '33', '33', '99', '27'),
(NULL, '32', '33', '33', '103', '169', '22'),
(NULL, '32', '33', '33', '33', '99', '23'),
(NULL, '32', '43', '43', '43', '129', '23'),
(NULL, '32', '33', '33', '33', '99', '24'),
(NULL, '31', '43', '43', '43', '129', '24'),
(NULL, '31', '33', '33', '33', '99', '44'),
(NULL, '30', '40', '60', '100', '160', '30'),
(NULL, '30', '40', '60', '100', '100', '10'),
(NULL, '30', '40', '60', '100', '100', '10'),
(NULL, '30', '40', '60', '100', '100', '30'),
(NULL, '29', '40', '60', '100', '100', '30'),
(NULL, '28', '40', '60', '100', '180', '23'),
(NULL, '28', '40', '60', '100', '100', '23'),
(NULL, '28', '40', '60', '100', '100', '23'),
(NULL, '28', '40', '60', '100', '100', '23'),
(NULL, '27', '60', '60', '60', '320', '20'),
(NULL, '26', '40', '40', '80', '120', '30'),
(NULL, '26', '40', '60', '100', '100', '20'),
(NULL, '25', '40', '40', '80', '100', '10'),
(NULL, '24', '40', '40', '80', '160', '33'),
(NULL, '23', '40', '40', '80', '120', '15'),
(NULL, '23', '40', '40', '80', '120', '15'),
(NULL, '23', '40', '40', '80', '120', '32'),
(NULL, '22', '40', '40', '80', '120', '22'),
(NULL, '22', '40', '60', '100', '100', '32'),
(NULL, '22', '40', '40', '80', '160', '32'),
(NULL, '22', '40', '40', '80', '120', '32'),
(NULL, '22', '40', '60', '100', '120', '23'),
(NULL, '21', '43', '43', '43', '129', '20'),
(NULL, '21', '60', '60', '60', '180', '20'),
(NULL, '20', '40', '40', '80', '160', '40'),
(NULL, '20', '40', '40', '80', '100', '10'),
(NULL, '19', '40', '60', '100', '100', '30'),
(NULL, '18', '40', '60', '100', '100', '23'),
(NULL, '18', '40', '60', '100', '100', '23'),
(NULL, '18', '40', '60', '100', '100', '23'),
(NULL, '17', '60', '60', '60', '120', '40'),
(NULL, '16', '40', '40', '80', '120', '30'),
(NULL, '16', '40', '60', '100', '100', '20'),
(NULL, '15', '40', '40', '80', '100', '10'),
(NULL, '14', '40', '40', '80', '160', '10'),
(NULL, '13', '40', '40', '80', '120', '15'),
(NULL, '13', '40', '40', '80', '120', '15'),
(NULL, '13', '40', '40', '80', '120', '32'),
(NULL, '12', '40', '40', '80', '120', '22'),
(NULL, '12', '40', '60', '100', '100', '44'),
(NULL, '12', '40', '40', '80', '160', '33'),
(NULL, '12', '40', '40', '80', '120', '33'),
(NULL, '12', '40', '60', '100', '120', '33'),
(NULL, '11', '40', '40', '80', '120', '42'),
(NULL, '11', '40', '60', '100', '100', '44'),
(NULL, '11', '40', '40', '80', '160', '42'),
(NULL, '11', '40', '40', '80', '160', '42'),
(NULL, '11', '40', '60', '100', '120', '42'),
(NULL, '10', '40', '40', '80', '160', '23'),
(NULL, '10', '40', '60', '100', '100', '24'),
(NULL, '10', '40', '40', '80', '160', '42'),
(NULL, '10', '40', '60', '100', '100', '44'),
(NULL, '8', '40', '60', '100', '200', '30'),
(NULL, '7', '43', '43', '43', '129', '20'),
(NULL, '7', '60', '60', '60', '120', '40'),
(NULL, '6', '40', '40', '80', '160', '40'),
(NULL, '6', '40', '60', '100', '200', '20'),
(NULL, '5', '40', '40', '80', '160', '10'),
(NULL, '5', '40', '40', '80', '160', '10'),
(NULL, '4', '40', '40', '80', '160', '10'),
(NULL, '3', '40', '40', '80', '160', '55'),
(NULL, '2', '33', '43', '43', '129', '24'),
(NULL, '2', '40', '60', '60', '180', '44'),
(NULL, '1', '40', '40', '80', '160', '53'),
(NULL, '1', '40', '60', '100', '200', '44');

-- --------------------------------------------------------

--
-- 表的结构 `t_passenger`
--

DROP TABLE IF EXISTS `t_passenger`;
CREATE TABLE IF NOT EXISTS `t_passenger` (
  `pno` varchar(256) COLLATE utf8_bin NOT NULL,
  `start` varchar(256) COLLATE utf8_bin NOT NULL,
  `destination` varchar(256) COLLATE utf8_bin NOT NULL,
  `cabin` varchar(256) COLLATE utf8_bin NOT NULL,
  `type` varchar(256) COLLATE utf8_bin NOT NULL,
  `fare` varchar(256) COLLATE utf8_bin NOT NULL,
  `cost` int(11) NOT NULL,
  PRIMARY KEY (`pno`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 转存表中的数据 `t_passenger`
--

INSERT INTO `t_passenger` (`pno`, `start`, `destination`, `cabin`, `type`, `fare`, `cost`) VALUES
('1', '兰州', '中国大陆', '头等舱', '留学生', '1000', -4),
('2', '兰州', '乌鲁木齐', '经济舱', '儿童', '1000', 720),
('3', '中国大陆', '乌鲁木齐', '不占座婴儿', '', '1000', -4),
('4', '中国大陆', '乌鲁木齐', '不占座婴儿', '', '1000', 0),
('5', '中国大陆', '乌鲁木齐', '不占座婴儿', '', '1000', -3),
('6', '中国大陆', '中国大陆', '公务舱', '天合联盟精英', '1000', 300),
('7', '兰州', '乌鲁木齐', '头等舱', '南航明珠金卡会员', '1000', -3),
('8', '兰州', '中国大陆', '经济舱', '留学生', '1000', 150),
('9', '中国大陆', '中国大陆', '经济舱', '留学生', '1000', 0),
('10', '兰州', '美国', '头等舱', '留学生', '1000', 8000),
('11', '美国', '中国大陆', '公务舱', '南航明珠金卡会员', '1000', 5000),
('12', '美国', '乌鲁木齐', '经济舱', '南航明珠银卡会员', '1000', 7000),
('13', '美国', '乌鲁木齐', '经济舱', '儿童', '1000', 2000),
('14', '中国大陆', '美国', '不占座婴儿', '', '1000', -3),
('15', '中国大陆', '美国', '不占座婴儿', '', '1000', 0),
('16', '新加坡', '中国大陆', '公务舱', '天合联盟精英', '1000', 0),
('17', '兰州', '迪拜', '头等舱', '南航明珠金卡会员', '1000', -4),
('18', '迪拜', '中国大陆', '经济舱', '留学生', '1000', 0),
('19', '迪拜', '兰州', '经济舱', '成人', '1000', 1000),
('20', '中国大陆', '日本', '明珠经济舱', '占座婴儿', '1000', -4),
('21', '兰州', '俄罗斯', '头等舱', '成人', '1000', 1000),
('22', '格鲁吉亚', '乌鲁木齐', '公务舱', '南航明珠银卡会员', '1000', 2750),
('23', '阿塞拜疆', '乌鲁木齐', '头等舱', '儿童', '1000', 0),
('24', '中国大陆', '乌兹别克斯坦', '经济舱', '成人', '1000', -4),
('25', '中国大陆', '吉尔吉斯斯坦', '不占座婴儿', '', '1000', 0),
('26', '土库曼斯坦', '中国大陆', '公务舱', '天合联盟超级精英', '1000', 0),
('27', '兰州', '巴基斯坦', '头等舱', '南航明珠金卡会员', '1000', -3),
('28', '内罗毕', '中国大陆', '头等舱', '劳务', '1000', 1000),
('29', '内罗毕', '兰州', '明珠经济舱', '成人', '1000', 2000),
('30', '内罗毕', '乌鲁木齐', '经济舱', '儿童', '1000', 8000),
('31', '其他国家', '中国大陆', '公务舱', '儿童', '1000', -4),
('32', '中国大陆', '其他国家', '经济舱', '劳务', '1000', 3750),
('33', '兰州', '其他国家', '明珠经济舱', '南航明珠银卡会员', '1000', 0),
('34', '中国大陆', '韩国', '经济舱', '占座婴儿', '1000', 1750),
('35', '韩国', '乌鲁木齐', '明珠经济舱', '成人', '1000', 3450),
('36', '韩国', '中国大陆', '公务舱', '天合联盟精英', '1000', -4),
('37', '兰州', '巴基斯坦', '头等舱', '南航明珠金卡会员', '1000', -2),
('38', '兰州', '中国大陆', '头等舱', '南航明珠金卡会员', '1000', -2),
('39', '美国', '韩国', '头等舱', '南航明珠金卡会员', '1000', -1);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
